package com.example.myapplication_2.data

object IngredientStore {
    val ingredients = mutableListOf(
        "청경채", "양배추즙", "레몬", "라임", "바나나", "사과", "배", "파인애플", "키위", "블루베리",
        "딸기잼", "토마토케첩", "토마토페이스트", "생크림", "연유", "휘핑크림", "푸딩믹스", "팬케이크믹스",
        "베이킹파우더", "베이킹소다", "바닐라에센스", "미소된장", "흑설탕", "황설탕", "강황가루", "큐민가루",
        "팔각", "계피가루", "코코넛밀크", "땅콩버터", "아몬드밀크", "귀리우유", "두유", "인스턴트커피", "홍차티백",
        "녹차가루", "쌍화차액", "누룽지", "누룽지탕", "청포묵", "도토리묵", "연근", "도라지", "더덕", "장아찌류 (마늘장아찌, 오이장아찌 등)",
        "훈제연어", "훈제오리", "무쌈", "김말이", "크래커", "유부", "유부초밥세트", "우엉조림", "마늘쫑", "감태",
        "다시멸치", "주먹밥용 후리가케", "계란말이 믹스", "양파즙", "숙주나물", "냉이", "달래", "참마", "마", "방아잎", "깻잎장아찌",
        "곤드레나물", "취나물", "고사리", "도라지무침", "연근조림", "생강청", "레몬청", "유자청", "흑임자", "깨소금", "볶은 참깨",
        "볶음용 채소믹스", "샐러드 믹스", "방울양배추", "아루굴라 (루꼴라)", "적양파", "적채", "케일", "버터넛 스쿼시", "렌틸콩", "병아리콩",
        "병조림 옥수수", "토마토홀", "푸실리", "링귀니", "리코타치즈", "생모짜렐라", "리에조또용 쌀", "바게트", "포카치아", "치아바타", "그래놀라",
        "견과류 믹스", "건과일 믹스","가지", "간장", "갈릭디핑소스", "갈치", "감자", "거위고기", "건새우", "게", "계란", "계란장", "고등어",
        "고등어통조림", "고추", "고추장", "고춧가루", "곤약", "국간장", "국수", "굴소스", "그릭요거트", "김", "김가루", "김치", "깍두기", "깻잎",
        "숙주","콩나물","꽁치통조림", "꿀", "냉동볶음밥", "냉동피자", "느타리버섯", "다시마", "다시팩", "단무지", "단호박", "닭가슴살", "닭다리살",
        "당근", "당면", "대파", "데리야끼소스", "돈가스", "된장", "두부", "떡", "떡갈비", "라면", "라면사리", "렌치 소스", "마늘", "마라소스",
        "마요네즈", "맛살", "머스타드", "메추리알", "멸치", "명란젓", "모닝빵", "모짜렐라치즈", "무", "물엿", "미역", "미원", "미트볼", "밀가루",
        "밥", "방울토마토", "버터", "버터헤드", "베이컨", "볶음김치", "부추", "부침가루", "불고기", "브로콜리", "비엔나 소세지", "사슴고기", "상추",
        "새송이버섯", "새우", "샐러드", "생닭", "샥스핀", "설탕", "소고기", "소금", "소금빵", "소면", "소시지", "숙주", "순두부", "스팸",
        "슬라이스치즈", "시금치", "시리얼", "시판피클", "식빵", "식용유", "쌀","떡","짜파게티","너구리","신라면","진라면","순두부","두부", "쌈장",
        "아몬드", "아보카도", "악어고기", "알룰로스", "애호박", "양념치킨소스", "양배추", "양상추", "양파", "어묵", "연두부", "열무", "열무김치", "염소고기",
        "오리고기", "오리엔탈 소스", "오이", "오징어", "오징어채", "옥수수", "올리고당", "올리브유", "와규", "완두콩", "요거트", "우동사리", "우엉", "우유", "육회",
        "자반고등어", "장조림", "잼", "조기", "조랭이떡", "조미김", "죽", "쯔유", "참기름", "참치", "참치캔", "청양고추", "체다치즈", "총각김치", "춘장", "치즈",
        "치킨 스톡", "치킨너겟", "칠면조", "카레가루", "캐비어", "캥거루고기", "케첩", "코코아 파우더", "콩", "콩나물", "크로와상", "크림소스", "크림치즈", "토마토",
        "토마토소스", "통닭", "투게더", "튀김가루", "파", "파래", "파마산치즈", "파스타면", "파스타소스", "파프리카", "팽이버섯", "플레인요거트", "피망", "한우", "핫도그",
        "해파리 냉채", "햄", "햄버거번", "호두", "홀그레인", "회", "후추", "흑돼지"


    )
}
